src/cf/src/Tasks/ЗадачиПользователя/ЗадачиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачиПользователя</name>
  <comment>Service Desk</comment>
  <basedOn>Catalog.РабочиеМеста</basedOn>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийИдентификатор</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителейЗадач</name>
    <type>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала выполнения задачи - для приоритезации исполнителем своих задач</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОценкиЗадачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияКИсполнению</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурационнаяЕдиница</name>
    <type>
      <types>CatalogRef.КонфигурационныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Оповещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокТрудозатратДляПриоритизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтмененаЗадача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаЗадачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПамятнаяДата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательУслуг</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятаКИсполнению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентЗавершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентЗавершенияДляПриоритизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяГруппаСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОповещения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПользователей</name>
    <comment>В качестве типа используется пустая ссылка</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Трудоемкость</name>
    <type>
      <types>DefinedType.ТрудоемкостьЧасовНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыНаОценку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланНаСпринт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПлановые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПредварительные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелОбмена</name>
    <comment>Идентификатор узла обмена распределенной базы данных плана обмена &quot;ОбменВРаспределеннойИнформационнойБазе&quot;</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочаяГруппа</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.ВнешниеПользователи</types>
        <types>CatalogRef.ГруппыВнешнихПользователей</types>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>ТипРаботы</name>
      <type>
        <types>EnumRef.ТипыРаботПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрудозатратыПлановые</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

src/cf/src/InformationRegisters/РаботыПоЗадачам/РаботыПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботыПоЗадачам</name>
  <resources>
    <name>ТрудозатратыПлановые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВнешнийИдентификатор</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРаботы</name>
    <type>
      <types>EnumRef.ТипыРаботПоЗадачам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЗадачиВРаботе/ЗадачиВРаботе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиВРаботе</name>
  <resources>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТипРаботы</name>
    <type>
      <types>EnumRef.ТипыРаботПоЗадачам</types>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Tasks/ЗадачиПользователя/Forms/ЗапланированныеЗадачи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ОтборМесяцПланирования = НачалоМесяца(ТекущаяДатаСеанса());
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущийДень", НачалоДня(ТекущаяДатаСеанса()));
	ОбновитьНастройкиСписка(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОбновитьНастройкиСписка(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПроектПриИзменении(Элемент)
	
	ОбновитьНастройкиСписка(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИсполнительПриИзменении(Элемент)
	
	ОбновитьНастройкиСписка(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВыполненныеПриИзменении(Элемент)
	
	ОбновитьНастройкиСписка(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМесяцПланированияПриИзменении(Элемент)
	
	ОтборМесяцПланирования = НачалоМесяца(ОтборМесяцПланирования);
	ОбновитьНастройкиСписка(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМесяцПланированияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборМесяцПланирования = ДобавитьМесяц(ОтборМесяцПланирования, Направление);
	ОбновитьНастройкиСписка(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоЗапланированныеЗадачиПриИзменении(Элемент)
	
	ОбновитьНастройкиСписка(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;	
	
	Если ТекущаяСтрока = ТекущаяЗадача Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТекущаяЗадача = ТекущаяСтрока;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ВнешнийНомер Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьЗадачуВоВнешнейСистемеНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

// - НачатьРаботуСЗадачей

&НаКлиенте
Процедура НачатьРаботуСЗадачей(Команда)
	
	Если Не ЗначениеЗаполнено(ТекущаяЗадача) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗадачаВРаботе = ЗадачаВРаботе(ТекущийПользователь);
	
	Если ЗадачаВРаботе = ТекущаяЗадача Тогда
		
		Возврат;
		
	ИначеЕсли ЗначениеЗаполнено(ЗадачаВРаботе) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьРаботуСЗадачейПослеПроверкиЗапущеннойЗадачи", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Сейчас в работе находится другая задача? Приостановить ее?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		НачатьРаботуСЗадачейВыбратьТипРабот();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьРаботуСЗадачейПослеПроверкиЗапущеннойЗадачи(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		НачатьРаботуСЗадачейВыбратьТипРабот();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьРаботуСЗадачейВыбратьТипРабот()
	
	РаботыПоЗадаче = РаботыПоЗадаче(ТекущаяЗадача, ТекущийПользователь);
	
	Если РаботыПоЗадаче.Количество() = 0 Тогда
		
		ТипРаботы = ПредопределенноеЗначение("Перечисление.ТипыРаботПоЗадачам.ПустаяСсылка");
		
	ИначеЕсли РаботыПоЗадаче.Количество() = 1 Тогда
		
		ТипРаботы = РаботыПоЗадаче[0];
		
	Иначе
		
		ТипРаботы = Неопределено;
		
	КонецЕсли;
	
	Если ТипРаботы = Неопределено Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьРаботуСЗадачейВыбратьТипРаботПродолжение", ЭтотОбъект);
		
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.ЗагрузитьЗначения(РаботыПоЗадаче);
		
		ПоказатьВыборИзМеню(ОписаниеОповещения, СписокВыбора, Элементы.ОсновнаяКоманднаяПанель);
		
	Иначе
		
		НачатьРаботуСЗадачейНаКлиенте(ТипРаботы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РаботыПоЗадаче(Задача, Исполнитель)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РаботыПоЗадачам.ТипРаботы КАК ТипРаботы,
	|	РаботыПоЗадачам.ТипРаботы.Порядок КАК ТипРаботыПорядок
	|ИЗ
	|	РегистрСведений.РаботыПоЗадачам КАК РаботыПоЗадачам
	|ГДЕ
	|	РаботыПоЗадачам.Задача = &Задача
	|	И РаботыПоЗадачам.Исполнитель = &Исполнитель
	|	И НЕ РаботыПоЗадачам.Выполнена
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипРаботыПорядок";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	РаботыПоЗадаче = Выгрузка.ВыгрузитьКолонку("ТипРаботы");
	
	Возврат РаботыПоЗадаче;
	
КонецФункции

&НаКлиенте
Процедура НачатьРаботуСЗадачейВыбратьТипРаботПродолжение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		НачатьРаботуСЗадачейНаКлиенте(ВыбранныйЭлемент.Значение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьРаботуСЗадачейНаКлиенте(ТипРаботы)
	
	НачатьРаботуСЗадачейНаСервере(ТипРаботы);
	ОповеститьОбИзменении(ТекущаяЗадача);
	
КонецПроцедуры

&НаСервере
Процедура НачатьРаботуСЗадачейНаСервере(ТипРаботы)
	
	РегистрыСведений.ЗадачиВРаботе.НачатьРаботуСЗадачей(ТекущийПользователь, ТекущаяЗадача, ТипРаботы);
	
КонецПроцедуры

// - ПриостановитьРаботуСЗадачей

&НаКлиенте
Процедура ПриостановитьРаботуСЗадачей(Команда)
	
	Если Не ЗначениеЗаполнено(ТекущаяЗадача) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗадачаВРаботе = ЗадачаВРаботе(ТекущийПользователь);
	
	Если ЗадачаВРаботе = ТекущаяЗадача Тогда
		
		ПриостановитьРаботуСЗадачейНаСервере();
		ОповеститьОбИзменении(ТекущаяЗадача);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриостановитьРаботуСЗадачейНаСервере()
	
	РегистрыСведений.ЗадачиВРаботе.ПриостановитьРаботуСЗадачей(ТекущийПользователь, ТекущаяЗадача);
	
КонецПроцедуры

// - ПланированиеЗадач

&НаКлиенте
Процедура ПланированиеЗадач(Команда)
	
	ОткрытьФорму("Обработка.ПланированиеВыполненияЗадач.Форма");
	
КонецПроцедуры

// - ОткрытьЗадачуВоВнешнейСистеме

&НаКлиенте
Процедура ОткрытьЗадачуВоВнешнейСистеме(Команда)
	
	ОткрытьЗадачуВоВнешнейСистемеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачуВоВнешнейСистемеНаКлиенте()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	ИначеЕсли Не ЗначениеЗаполнено(ТекущиеДанные.ВнешняяСсылка) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ТекущиеДанные.ВнешняяСсылка);
	
КонецПроцедуры

// Вспомогательные функции

&НаСервереБезКонтекста
Функция ЗадачаВРаботе(ТекущийПользователь)
	
	МенеджерЗаписи = РегистрыСведений.ЗадачиВРаботе.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Исполнитель = ТекущийПользователь;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		
		Возврат МенеджерЗаписи.Задача;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьНастройкиСписка(Контекст)
	
	Список = Контекст.Список;
	Проект = Контекст.ОтборПроект;
	Исполнитель = Контекст.ОтборИсполнитель;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "МесяцПланирования", Контекст.ОтборМесяцПланирования);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТолькоЗапланированныеЗадачи", Контекст.ТолькоЗапланированныеЗадачи);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Исполнитель", Исполнитель, , , ЗначениеЗаполнено(Исполнитель));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Выполнена", Ложь, , , Не Контекст.ПоказыватьВыполненные);
	
	// ПАРАМЕТР ИСПОЛНИТЕЛЬ
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		
		ПараметрИсполнитель = Исполнитель;
		
	Иначе
		
		ПараметрИсполнитель = Контекст.ТекущийПользователь;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Исполнитель", ПараметрИсполнитель);
	
	// ОТБОР ПРОЕКТ
	СписокПроектов = Новый СписокЗначений;
	ВидСравненияКомпоновки = ВидСравненияКомпоновкиДанных.ВСписке;
	
	Если Проект = ПредопределенноеЗначение("Справочник.Проекты.ИзбранныеПроекты") Тогда
		
		МассивПроектов = РаботаСЗадачамиВызовСервера.МассивИзбранныхПроектовТекущегоПользователя();
		СписокПроектов.ЗагрузитьЗначения(МассивПроектов);
		
	ИначеЕсли Проект = ПредопределенноеЗначение("Справочник.Проекты.БезПроекта") Тогда		
		
		СписокПроектов.Добавить(ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка"));
		СписокПроектов.Добавить(ПредопределенноеЗначение("Справочник.Проекты.БезПроекта"));

	ИначеЕсли ЗначениеЗаполнено(Проект) Тогда		
		
		СписокПроектов.Добавить(Проект);
		ВидСравненияКомпоновки = ВидСравненияКомпоновкиДанных.ВИерархии;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Проект", СписокПроектов, ВидСравненияКомпоновки, , ЗначениеЗаполнено(Проект));
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
